Quora-mini/app/controllers/comments_controller.rb

SELECT  `questions`.* FROM `questions` WHERE `questions`.`id` = 13 LIMIT 1
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
INSERT INTO `comments` (`comment`, `question_id`, `user_id`, `created_at`, `updated_at`) VALUES ('Great one!!', 13, 1, '2018-06-10 09:03:18', '2018-06-10 09:03:18')
---
  def create
    @question = Question.find(params[:question_id])
    @user = User.find(params[:user_id])
    @comment = @question.comments.build(comment_params)
    @comment.user = @user
    flash[:success] = 'Comment added' if @comment.save