Quora-mini/app/controllers/questions_controller.rb

SELECT `questions`.`id` FROM `questions` ORDER BY created_at desc
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1
SELECT `questions`.`id` FROM `questions` WHERE `questions`.`user_id` = 1 ORDER BY created_at desc
SELECT `comments`.`id` FROM `comments`
---
  def index
    @questions = Question.all.recent
    @question = Question.new
    @user = User.find(params[:user_id])
    @question.user = @user
    @user_questions = @questions.all.usr(@user.id).recent
    @qn_comments = Comment.cmt(@questions.pluck(:id))

SELECT  `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
INSERT INTO `questions` (`question`, `description`, `user_id`, `created_at`, `updated_at`) VALUES ('sgsfsfg', 'sgsdg', 1, '2018-06-09 16:17:15', '2018-06-09 16:17:15')
---
  def create
    @question = Question.new(question_params)

    user = User.find(params[:user_id])
    @question.user = user
    if @question.save

UPDATE `questions` SET `question` = 'Ruby Mixins', `description` = 'Modules have another, wonderful use. At a stroke, they pretty much eliminate the need for multiple inheritance, providing a facility called a mixin.', `updated_at` = '2018-06-10 19:45:08' WHERE `questions`.`id` = 14
---
  def update
    if @question.update_attributes(question_params)

DELETE FROM `questions` WHERE `questions`.`id` = 1
---
  def destroy
    @question.destroy

SELECT `questions`.* FROM `questions` WHERE `questions`.`question_id` = '1' ORDER BY created_at desc
SELECT  `users`.* FROM `users` WHERE `users`.`id` = NULL LIMIT 1
---
  def myquestions
    @questions = Question.all.usr(params[:user_id]).recent
    @question = Question.new
    @user = User.find(params[:user_id])

SELECT `questions`.* FROM `questions` WHERE `questions`.`id` = 1 ORDER BY created_at desc
---
  def set_question
    @question = Question.find(params[:id])