Quora-mini/app/views/comments/_comment.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 2 LIMIT 1
---
  <% if comment.comment%>
    <% usr = User.find(comment.user_id)%>