Quora-mini/app/views/questions/index.html.erb

        <div class="vbar">
          <p> <%= pluralize(@questions.count, 'Question') %> </p>
---
SELECT COUNT(*) FROM `questions`
SELECT `questions`.* FROM `questions` ORDER BY created_at desc

        <div class="vbar">
          <p> <%= pluralize(@qn_comments.count, 'Comment') %> </p>
---
SELECT COUNT(*) FROM `comments` WHERE (question_id IN (37,17,14,13)) AND `comments`.`question_id` = 37

        <div class="vbar">
          <p> <%= pluralize(@user_questions.count, 'Question') %> </p>
---
SELECT COUNT(*) FROM `questions` WHERE `questions`.`user_id` = 1
SELECT `questions`.`id` FROM `questions` WHERE `questions`.`user_id` = 1 ORDER BY created_at desc