Quora-mini/app/views/questions/myquestions.html.erb

SELECT COUNT(*) FROM `questions`
SELECT `questions`.* FROM `questions` WHERE `questions`.`question_id` = '1' ORDER BY created_at desc
---
        <div class="vbar">
          <p> <%= pluralize(@questions.count, 'Question') %> </p>

SELECT COUNT(*) FROM `comments` WHERE (question_id IN (17,14,13)) AND `comments`.`question_id` = 17
---
        <div class="vbar">
          <p> <%= pluralize(@qn_comments.count, 'Comment') %> </p>