Quora-mini/app/views/questions/show.html.erb

SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
---

  <% usr = User.find(@question.user_id)%>